* Optional
 result를 포함하려면 header args에 :exports both를 잊으면 안됨
** initial example
:PROPERTIES:
:header-args:swift: :session swift-01
:END:
Optional residence를 가지고 있는 Person Class
#+begin_src swift :results none
  class Residence {
      var numberOfRooms = 1
  }
  class Person {
      var residence: Residence?
  }
  
#+end_src

If you create a new Person instance, its residence property is default initialized to nil, by virtue of being optional. In the code below, john has a residence property value of nil:

#+begin_src swift
let john = Person()
if let roomCount = john.residence?.numberOfRooms {
    print("John's residence has \(roomCount) room(s).")
} else {
    print("Unable to retrieve the number of rooms.")
}
// Prints "Unable to retrieve the number of rooms."
#+end_src

#+RESULTS:
: john: Person = {
:   residence = nil
: }
: Unable to retrieve the number of rooms.

위의 결과가 나오는 이유는 residence가 nil이기 때문에 그 이후로 접근을 할 수 없기때문에

#+begin_src swift
  let john1 = Person()
  var residence = Residence()
  john1.residence = residence
  //john1.residence = Residence()
  if let roomCount = john1.residence?.numberOfRooms {
      print("John's residence has \(roomCount) room(s).")
  } else {
      print("Unable to retrieve the number of rooms.")
  }
  // Prints "John's residence has 1 room(s)."
#+end_src

residence를 어사인 했기 때문에 이제는 접근 가능

#+RESULTS:
: john1: Person = {
:   residence = nil
: }
: residence: Residence = {
:   numberOfRooms = 1
: }
: John's residence has 1 room(s).

** more elaborated example
:PROPERTIES:
:header-args:swift: :session swift-02
:END:
Room Address Residence class declaration
#+begin_src swift
  class Room {
      let name: String
      init(name: String) { self.name = name }
  }
  class Address {
      var buildingName: String?
      var buildingNumber: String?
      var street: String?
      func buildingIdentifier() -> String? {
          if let buildingNumber = buildingNumber, let street = street {
              return "\(buildingNumber) \(street)"
          } else if buildingName != nil {
              return buildingName
          } else {
              return nil
          }
      }
  }
  
  class Residence{
      var rooms: [Room] = []
      var numberOfRooms: Int {
          return rooms.count
      }
      subscript(i: Int) -> Room {
          get {
              return rooms[i]
          }
          set {
              rooms[i] = newValue
          }
      }
      func printNumberOfRooms() {
          print("The number of rooms is \(numberOfRooms)")
      }
      var address: Address?
  }
  
  class Person {
      var residence: Residence?
  }
  
#+end_src

#+RESULTS:
: 8. 9. 10. 11. 12. 13. 14. 15. 16. 17. 18. 19. 20. 21> 22> 23. 24. 25. 26. 27. 28. 29. 30. 31. 32. 33. 34. 35. 36. 37. 38. 39. 40> 41> 42. 43. 44> 45> $R1: String = "ob-swift-eoe"

#+begin_src swift 
let john = Person()
let someAddress = Address()
someAddress.buildingNumber = "29"
someAddress.street = "Acacia Road"
john.residence?.address = someAddress
if let roomCount = john.residence?.numberOfRooms {
    print("John's residence has \(roomCount) room(s).")
} else {
    print("Unable to retrieve the number of rooms.")
}
// Prints "Unable to retrieve the number of rooms."
#+end_src

#+RESULTS:
#+begin_example
john: Person = {
  residence = nil
}
someAddress: Address = {
  buildingName = nil
  buildingNumber = nil
  street = nil
}
$R2: ()? = nil
Unable to retrieve the number of rooms.
#+end_example

#+begin_src swift
  john.residence = nil 
  john.residence?.address = someAddress
if let roomCount = john.residence?.numberOfRooms {
    print("John's residence has \(roomCount) room(s).")
} else {
    print("Unable to retrieve the number of rooms.")
}
#+end_src

#+RESULTS:
: $R4: ()? = nil
: Unable to retrieve the number of rooms.

#+begin_src swift
func createAddress() -> Address {
    print("Function was called.")

    let someAddress = Address()
    someAddress.buildingNumber = "29"
    someAddress.street = "Acacia Road"

    return someAddress
}
john.residence?.address = createAddress()
#+end_src

#+RESULTS:
: $R6: ()? = nil
#+begin_src swift
  if john.residence?.printNumberOfRooms() != nil {
      print("It was possible to print the number of rooms.")
  } else {
      print("It was not possible to print the number of rooms.")
  }
#+end_src

#+RESULTS:

: It was not possible to print the number of rooms.
#+begin_src swift
if let firstRoomName = john.residence?[0].name {
    print("The first room name is \(firstRoomName).")
} else {
    print("Unable to retrieve the first room name.")
}
// Prints "Unable to retrieve the first room name."
#+end_src

#+RESULTS:
: Unable to retrieve the first room name.

#+begin_src swift
john.residence?[0] = Room(name: "Bathroom")
#+end_src

#+RESULTS:
: $R9: ()? = nil
#+begin_src swift
let johnsHouse = Residence()
johnsHouse.rooms.append(Room(name: "Living Room"))
johnsHouse.rooms.append(Room(name: "Kitchen"))
john.residence = johnsHouse

if let firstRoomName = john.residence?[0].name {
    print("The first room name is \(firstRoomName).")
} else {
    print("Unable to retrieve the first room name.")
}
// Prints "The first room name is Living Room."
#+end_src

#+RESULTS:
: johnsHouse: Residence = {
:   rooms = 0 values
:   address = nil
: }
: The first room name is Living Room.

*** Method Chanining with Optional Return Value
#+begin_src swift
if let johnsStreet = john.residence?.address?.street {
    print("John's street name is \(johnsStreet).")
} else {
    print("Unable to retrieve the address.")
}
// Prints "Unable to retrieve the address."
#+end_src

#+RESULTS:
: Unable to retrieve the address.

#+begin_src swift
let johnsAddress = Address()
johnsAddress.buildingName = "The Larches"
johnsAddress.street = "Laurel Street"
john.residence?.address = johnsAddress

if let johnsStreet = john.residence?.address?.street {
    print("John's street name is \(johnsStreet).")
} else {
    print("Unable to retrieve the address.")
}
// Prints "John's street name is Laurel Street."
#+end_src

#+RESULTS:
: johnsAddress: Address = {
:   buildingName = nil
:   buildingNumber = nil
:   street = nil
: }
: $R20: ()? = some
: John's street name is Laurel Street.

#+begin_src swift
if let buildingIdentifier = john.residence?.address?.buildingIdentifier() {
    print("John's building identifier is \(buildingIdentifier).")
}
// Prints "John's building identifier is The Larches."
#+end_src

#+RESULTS:
: John's building identifier is The Larches.


** 옵셔널 타입에 서브 스크립트 접근 (Accessing Subscripts of Optional Type)
#+begin_src swift :exports both
  var testScores = ["Dave": [86, 82, 84], "Bev": [79, 94, 81]]
  testScores["Dave"]?[0] = 91
  testScores["Bev"]?[0] += 1
  testScores["Brian"]?[0] = 72
  print(testScores)
  // the "Dave" array is now [91, 82, 84] and the "Bev" array is now [80, 94, 81]
#+end_src

#+RESULTS:
: ["Dave": [91, 82, 84], "Bev": [80, 94, 81]]


